In [ ]:
create a two dataframe and merge them with  firstly inner and  secondly outer method.

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'col1':[11,112,13], 'col2': [21,122,23]})
df2 = pd.DataFrame({'col1':[111,112,113], 'col2': [121,122,123]})

In [3]:
df1

   col1  col2
0    11    21
1   112   122
2    13    23

In [4]:
df2

   col1  col2
0   111   121
1   112   122
2   113   123

In [5]:
pd.merge(df1,df2, on="col1", how="inner")

   col1  col2_x  col2_y
0   112     122     122

In [6]:
pd.merge(df1,df2, on="col1", how="outer")

   col1  col2_x  col2_y
0    11    21.0     NaN
1   112   122.0   122.0
2    13    23.0     NaN
3   111     NaN   121.0
4   113     NaN   123.0